# common_dicts.py

weapon_type_mapping = {
    0x00: "無",
    "-1": "--------------------火--------------------",
    0x01: "燃燒(武:+2火傷害,防:+抗火+5)", 
    0x02: "火焰(武:+3火傷害,防:+抗火+7)", 
    0x03: "火熱(武:+4火傷害,防:抗火+9)", 
    0x04: "溫熱(武:+5火傷害,防:抗火+11)", 
    0x05: "炎熱(武:+10火傷害,防:抗火+15)", 
    0x06: "滾熱(武:+15火傷害,防:抗火+20)", 
    0x07: "烈火(武:+20火傷害,防:抗火+25)", 
    0x08: "灼熱(武:+30火傷害,防:抗火+30)",
    "-2": "--------------------電--------------------",
    0x09: "閃爍(武:+2電傷害,防:抗電+5)", 
    0x0A: "閃光(武:+3電傷害,防:抗電+7)", 
    0x0B: "靜電(武:+4電傷害,防:抗電+9)", 
    0x0C: "電光(武:+5電傷害,防:抗電+11)", 
    0x0D: "電擊(武:+10電傷害,防:抗電+15)", 
    0x0E: "雷電(武:+15電傷害,防:抗電+20)", 
    0x0F: "超電力(武:+20電傷害,防:抗電+25)", 
    "-3": "--------------------冰--------------------", 
    0x10: "極冷(武:+2冰傷害,防:抗冰+5)", 
    0x11: "酷寒(武:+4冰傷害,防:抗冰+10)", 
    0x12: "冰凍(武:+7冰傷害,防:抗冰+15)", 
    0x13: "寒冰(武:+10冰傷害,防:抗冰+20)", 
    0x14: "凍結(武:+20冰傷害,防:抗冰+25)", 
    "-4": "--------------------酸--------------------", 
    0x15: "酸化(武:+2酸/毒傷害,防:抗酸/毒+10)", 
    0x16: "微毒(武:+4酸/毒傷害,防:抗酸/毒+15)", 
    0x17: "沁毒(武:+8酸/毒傷害,防:抗酸/毒+20)", 
    0x18: "劇毒(武:+16酸/毒傷害,防:抗酸/毒+30)", 
    0x19: "猛毒(武:+32酸/毒傷害,防:抗酸/毒+40)", 
    "-5": "--------------------能量--------------------", 
    0x1A: "泛紅(武:+2能量傷害,防:+抗能量+5)", 
    0x1B: "白熱(武:+3能量傷害,防:+抗能量+7)", 
    0x1C: "氣密(武:+4能量傷害,防:+抗能量+9)", 
    0x1D: "音波(武:+5能量傷害,防:+抗能量+11)", 
    0x1E: "電能(武:+10能量傷害,防:+抗能量+13)", 
    0x1F: "X燙(武:+15能量傷害,防:+抗能量+15)", 
    0x20: "輻射(武:+20能量傷,防:+抗能量+20)", 
    0x21: "動力(武:+30能量傷害,防:+抗能量+25)", 
    "-6": "--------------------魔法--------------------", 
    0x22: "神秘(武:+5魔法傷害,防:抗魔法+5)", 
    0x23: "魔法(武:+10魔法傷害,防:抗魔法+10)", 
    0x24: "靈波(武:+25魔法傷害,防:抗魔法+25)", 
    "-7": "--------------------物理--------------------", 
    0x25: "木頭(武:-3、HIT-3,防:-3)", 
    0x26: "皮革(武:-4、HIT-4,防:0)", 
    0x27: "銅(武:-4、HIT+3,防:-2)", 
    0x28: "青銅(武:-2、HIT+2,防:-1)", 
    0x29: "鐵(武:+2、HIT+1,防:+1)", 
    0x2A: "銀(武:+4、HIT+2,防:+2)", 
    0x2B: "鋼(武+6:、HIT+3,防:+4)", 
    0x2C: "金(武:+8、HIT+4,防:+6)", 
    0x2D: "白金(武:+10、HIT+6,防:+8)", 
    0x2E: "玻璃(武:+0、HIT+0,防:+0)", 
    0x2F: "珊瑚(武:+1、HIT+1,防:+1)", 
    0x30: "水晶(武:+1、HIT+1,防:+1)", 
    0x31: "寶石(武:+2、HIT+2,防:+2)", 
    0x32: "珍珠(武:+2、HIT+2,防:+2)", 
    0x33: "琥珀(武:+3、HIT+3,防:+2)", 
    0x34: "烏木(武:+4、HIT+4,防:+4)", 
    0x35: "石英(武:+5、HIT+5,防:+5)", 
    0x36: "紅寶石(武:+12、HIT+6,防:+10)", 
    0x37: "翡翠(武:+15、HIT+7,防:+12)", 
    0x38: "藍寶石(武:+20、HIT+8,防:+14)", 
    0x39: "鑽石(武:+30、HIT+9,防:+16)", 
    0x3A: "黑曜石(武:+50、HIT+10,防:+20)*", 
    "-8": "--------------------力量--------------------", 
    0x3b:"力量(+2力量)", 
    0x3c:"力氣(+3力量)", 
    0x3d:"戰士(+5力量)", 
    0x3e:"食人巨魔(+8力量)", 
    0x3f:"巨人(+12力量)", 
    0x40:"雷電(+17力量)", 
    0x41:"原力(+23力量)", 
    0x42:"能量(+30力量)", 
    0x43:"龍(+38力量)", 
    0x44:"光子(+47力量)*", 
    "-9": "--------------------智慧--------------------",    
    0x45:"聰明(+2智慧)", 
    0x46:"精神(+3智慧)", 
    0x47:"賢明(+5智慧)", 
    0x48:"思想(+8智慧)", 
    0x49:"知識(+12智慧)", 
    0x4a:"智慧(+17智慧)", 
    0x4b:"睿智(+23智慧)", 
    0x4c:"天賦(+30智慧)*",   
    "-10": "--------------------人格--------------------",
    0x4d:"夥伴(+2人格)", 
    0x4e:"友誼(+3人格)", 
    0x4f:"魅力(+5人格)", 
    0x50:"人格(+8人格)", 
    0x51:"非凡魅力(+12人格)", 
    0x52:"領導(+17人格)", 
    0x53:"自我(+23人格)", 
    0x54:"莊嚴(+30人格)*",    
    "-11": "--------------------速度--------------------", 
    0x55:"敏捷(+2速度)", 
    0x56:"迅速(+3速度)", 
    0x57:"快速(+5速度)", 
    0x58:"疾速(+8速度)", 
    0x59:"快速(+12速度)", 
    0x5a:"風速(+17速度)", 
    0x5b:"加速(+23速度)", 
    0x5c:"極速(+30速度)*",    
    "-12": "--------------------準確--------------------", 
    0x5d:"準確(+3命中)", 
    0x5e:"精準(+5命中)", 
    0x5f:"神射手(+10命中)", 
    0x60:"精準(+15命中)", 
    0x61:"正中(+20命中)", 
    0x62:"神準(+30命中)*",    
    "-13": "--------------------運氣--------------------", 
    0x63:"幸運(+5運氣)", 
    0x64:"機會(+10運氣)", 
    0x65:"贏家(+15運氣)", 
    0x66:"運氣(+20運氣)", 
    0x67:"賭徒(+25運氣)", 
    0x68:"幸運妖精(+30運氣)*",    
    "-14": "--------------------生命--------------------", 
    0x69:"精神飽滿(+4生命)", 
    0x6a:"良好(+6生命)", 
    0x6b:"正常(+10生命)", 
    0x6c:"超強(+20生命)", 
    0x6d:"不死(+50生命)*",   
    "-15": "--------------------法力--------------------",  
    0x6e:"咒法(+4法力)", 
    0x6f:"施法(+8法力)", 
    0x70:"鬼巫(+12法力)", 
    0x71:"魔法師(+16法力)", 
    0x72:"大法師(+20法力)", 
    0x73:"魔法長老(+25法力)*",  
    "-16": "--------------------防禦--------------------",   
    0x74:"防護(+2防禦)", 
    0x75:"盔甲(+4防禦)", 
    0x76:"防禦(+6防禦)", 
    0x77:"神秘(+10防禦)", 
    0x78:"神聖(+16防禦)*",  
    "-17": "--------------------開鎖--------------------",   
    0x79:"小賊(+4開鎖)", 
    0x7a:"夜盜(+6開鎖)", 
    0x7b:"掠奪者(+8開鎖)", 
    0x7c:"土匪(+10開鎖)", 
    0x7d:"竊賊(+12開鎖)", 
    0x7e:"小偷(+14開鎖)", 
    0x7f:"惡棍(+16開鎖)", 
    0x80:"搶犯(+18開鎖)", 
    0x81:"罪犯(+20開鎖)", 
    0x82:"海盜(+25開鎖)*",
}

WEAPON_ID_DESCRIPTIONS = {
    0x00:"無",    
    "-1": "----------單手武器--------",   
    0x01:"長劍(3~7)",
    0x02:"短劍(2~6)",
    0x03:"闊劍(3~12)",
    0x04:"月形彎刀(2~10)",
    0x05:"彎刀(2~8)",
    0x06:"軍刀(4~8)",
    0x07:"短棍(1~3)",
    0x08:"短斧(2~6)",
    0x09:"武士長刀(4~12)武游忍*",
    0x0a:"雙節棍(3~7)",
    0x0b:"武士短刀(3~9",
    0x0c:"匕首(2~4)",
    0x0d:"狼牙棒(2~8)",
    0x0e:"鏈枷(1~10)",
    0x0f:"短棒(1~6)",
    0x10:"大鎚(1~8)",
    0x11:"槍(1~9)",
    "-2": "----------雙手武器--------",
    0x12:"長柄大刀(4~16)忍",
    0x13:"雙手闊刀(4~12)",
    0x14:"戟(3~18)",
    0x15:"長矛(2~16)",
    0x16:"雙手巨劍(4~20)",
    0x17:"三叉戟(2~12)",
    0x18:"長棍(2~8)",
    0x19:"鐵鎚(2~10)",
    0x1a:"刀杖(5~15)忍",
    0x1b:"戰斧(3~15)",
    0x1c:"大斧(3~18)",
    0x1d:"巨斧(2~21)牧巫德除外*",
    0x1e:"短弓(3~6)", 
    0x1f:"長弓(5~10)", 
    0x20:"十字弓(4~8)", 
    0x21:"投石索(2~6)", 
    0x22:"伏魔神劍",
    0x38:"聖甲蟲(作弊弓)",
}

WEAPON_SPECIAL_EFFECTS = {
        0x00:"無",
        0x01:"屠龍者",    
        0x02:"食屍者",    
        0x03:"簷怪剋星",    
        0x04:"驅蟲者",    
        0x05:"怪物終結者",    
        0x06:"野獸剋星",
}

def_Amo = {
    0x00: "無",    
    0x01:"長袍(1)", 
    0x02:"鱗甲(4)", 
    0x03:"鎖子甲(5)", 
    0x04:"鏈條甲(6)", 
    0x05:"軟甲(7)", 
    0x06:"鎧甲(8)", 
    0x07:"凱冑(10)", 
    0x08:"盾牌(4)", 
    0x09:"鋼盔(2)", 
    0x0a:"靴子(1)", 
    0x0b:"披風(1)", 
    0x0c:"斗篷(1)", 
    0x0d:"手套(1)", 
}

ring_ID_EQ = {
    0x00: "無",    
    0x01:"戒指",    
    0x02:"腰帶",    
    0x03:"胸章(勳章類)",    
    0x04:"勳章(勳章類)",    
    0x05:"咒符(勳章類)",    
    0x06:"憉貝(勳章類)",    
    0x07:"聖甲蟲(勳章類)",    
    0x08:"垂飾(項鍊類)",    
    0x09:"項鍊(項鍊類)",    
    0x0a:"護身符(項鍊類)",
}

item_ID = {
    0x00: "無",    
    0x01:"權杖",    
    0x02:"珠寶",    
    0x03:"寶石",   
    0x04:"盒子",    
    0x05:"寶珠",   
    0x06:"號角",   
    0x07:"硬幣",    
    0x08:"魔杖",    
    0x09:"哨子",    
    0x0a:"藥水",    
    0x0b:"卷軸",    
    0x0c:"偽造的",
}

item_type_mapping = {
    0x00: "無",
    0x01:"照明術",
    0x02:"喚醒術",
    0x03:"魔法之箭",
    0x04:"急救術",
    0x05:"飛拳術",
    0x06:"能量球",
    0x07:"催眠術",
    0x08:"元氣重生",
    0x09:"治療術",
    0x0a:"電光石火",
    0x0b:"元素飛鏢",
    0x0c:"驅除昆蟲",
    0x0d:"毒雲術",
    0x0e:"元素護衛",
    0x0f:"傷痛術",
    0x10:"跳躍術*",
    0x11:"野獸控制",
    0x12:"感應透視",
    0x13:"驅魔術",
    0x14:"漂浮術",
    0x15:"巫師之眼",
    0x16:"祝福術",
    0x17:"怪物識別",
    0x18:"電擊術",
    0x19:"神功附體",
    0x1a:"強效治療",
    0x1b:"自然治療",
    0x1c:"魯易浮標*",
    0x1d:"強力護罩",
    0x1e:"勇氣術",
    0x1f:"魔法催眠",
    0x20:"水上漂",
    0x21:"冰沁術",
    0x22:"偵測怪物",
    0x23:"火球術",
    0x24:"冷凍光線",
    0x25:"解毒術",
    0x26:"噴酸術",
    0x27:"穿越時空*",
    0x28:"龍眠術",
    0x29:"預防術",
    0x2a:"傳送術*",
    0x2b:"死亡術",
    0x2c:"自由移動",
    0x2d:"克制魔偶",
    0x2e:"毒箭術",
    0x2f:"致命毒蟲",
    0x30:"魔法庇護",
    0x31:"庇護大法*",
    0x32:"幻術大法*",
    0x33:"魔法盛宴",
    0x34:"火焰枷鎖",
    0x35:"魔法充電*",
    0x36:"神奇冷凍",
    0x37:"神奇冷凍",
    0x38:"解除石化",
    0x39:"起死回生",
    0x3a:"穿透術*",
    0x3b:"飛劍術",
    0x3c:"月光術",
    0x3d:"倍數重力",
    0x3e:"奇異之光",
    0x3f:"魔法改良",
    0x40:"焚化術",
    0x41:"神聖之咒",
    0x42:"再造生命",
    0x43:"風暴術",
    0x44:"高壓電擊",
    0x45:"地獄之火",
    0x46:"太陽射線",
    0x47:"滅魔心法",
    0x48:"銀河星爆",
    0x49:"神恩浩盪",
}

# 字典檔 (member_data.py)
OFFSET1 = 0x14
OFFSET2 = 0x123
MAP_OFFSET = 0xA6

# 最後一個隊員的編號 (例如，如果想要到隊員20，就設為 20)
#NUM_TEAMS = 24

# 提供第一個隊員的 base address
FIRST_TEAM_BASE_ADDRESS = 0x0E01

# 每個隊員 base address 之間的間隔 (已確定)
ADDRESS_INCREMENT = 0x162

# 使用列表生成式和字典生成式產生 team_data 最大創造人數為24
team_data = {
    f'隊員{i}': FIRST_TEAM_BASE_ADDRESS + (i - 1) * ADDRESS_INCREMENT
    for i in range(1, 25)
}

# 直接創建變數 member_addresses
member_addresses = {}
for member, base_address in team_data.items():
    address1 = base_address
    address2 = base_address + OFFSET1
    address3 = address2 + OFFSET2
    member_addresses[member] = (address1, address2, address3)

# 直接創建變數 address_map
address_map = {}
for member, base_address in team_data.items():
    address_map[member] = base_address + MAP_OFFSET

team_members = list(team_data.keys()) # 從 team_data 取得隊員名稱列表

'''
# 測試程式碼 (顯示為十六進制)
print("Team Members:", team_members)
print("\nMember Addresses:")
for member, addresses in member_addresses.items():
    address1, address2, address3 = addresses
    print(f"  {member}: (0x{address1:X}, 0x{address2:X}, 0x{address3:X})")

print("\nAddress Map:")
for member, address in address_map.items():
    print(f"  {member}: 0x{address:X}")
'''

attributes = [
    '力量', '智慧', '人格', '耐力', '速度', '準確', '運氣', '等級'
]

resistances = [
    '火抗性', '冰抗性', '電抗性', '毒抗性', '能量抗性', '魔法抗性'
]

team_labels = ["目前年分", "隊伍金幣", "銀行存款", "隊伍寶石", "銀行寶石","紅寶石塊","鑽石塊"]
team_addresses = [(0x39E3, 2), (0x39FB, 4), (0x3A03, 4), (0x39FF, 4), (0x3A07, 4), (0x3AB7, 1), (0x3ABA, 1)]

class_nb = {
    0x00:"武士",
    0x01:"遊俠",
    0x02:"弓箭手",
    0x03:"牧師",
    0x04:"巫師",
    0x05:"盜賊",
    0x06:"忍者",
    0x07:"野蠻人",
    0x08:"德魯伊",
    0x09:"流浪漢",
}

WAP_Eq = {
    0x00:"不裝備",
    0x01:"單手武器",
    0x04:"弓",
    0x0d:"雙手武器",
}

Def_Eq = {
    0x00:"不裝備",
    0x02:"盾牌",
    0x03:"盔甲",
    0x05:"鋼盔",
    0x06:"手套",
    0x09:"鞋子",
    0x0a:"披風類",
}

rinq_eq = {
    0x00:"不裝備",
    0x07:"勳章類",
    0x08:"戒指",
    0x0b:"項鍊類",
    0x0c:"腰帶",
}

